<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d6cde0523b0ff9de37dcb3cd94f3e0f38226336c4a070d965175a6ac4a3ba3b2","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1018 at https://github.com/cal-itp/data-infra/actions/runs/19479909283","plan_out_hash":"d60f4c65c45b0fb1cbfd1fc2696a52cee6954f15cfabec68278dec74d95f6c8f","plan_hash":"4c6c7f1e8c701988a07cb32ae3e64e36a1fc4d2850686d8e987731a3f6ef64f6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 3 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["macros/define_day_of_week.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "ET8QqA==" -> (known after apply)
!~      detect_md5hash      = "ChZACEju9v6zys5tCMQ7NA==" -> "different hash"
!~      generation          = 1758837112328394 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/define_day_of_week.sql"
!~      md5hash             = "ChZACEju9v6zys5tCMQ7NA==" -> (known after apply)
        name                = "data/warehouse/macros/define_day_of_week.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/gtfs_route_labels.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/macros/gtfs_route_labels.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/macros/gtfs_route_labels.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_daily_scheduled_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "dPn8jw==" -> (known after apply)
!~      detect_md5hash      = "qcclLlkBGJKsh3RAiFaxCg==" -> "different hash"
!~      generation          = 1751416661584762 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
!~      md5hash             = "qcclLlkBGJKsh3RAiFaxCg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_rollup/_mart_gtfs_rollup.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "y7hGrg==" -> (known after apply)
!~      detect_md5hash      = "faBBwPhhSTVVIFbTzpf+4Q==" -> "different hash"
!~      generation          = 1762367116955755 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs_rollup/_mart_gtfs_rollup.yml"
!~      md5hash             = "faBBwPhhSTVVIFbTzpf+4Q==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_rollup/_mart_gtfs_rollup.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_rollup/fct_monthly_routes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "YVlV2w==" -> (known after apply)
!~      detect_md5hash      = "MWeFBodGFwJEDBKzqvgKxA==" -> "different hash"
!~      generation          = 1762367116971824 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs_rollup/fct_monthly_routes.sql"
!~      md5hash             = "MWeFBodGFwJEDBKzqvgKxA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_routes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_rollup/fct_monthly_rt_route_direction_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_rt_route_direction_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs_rollup/fct_monthly_rt_route_direction_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_rollup/fct_monthly_schedule_route_direction_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_schedule_route_direction_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs_rollup/fct_monthly_schedule_route_direction_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_rollup/fct_monthly_scheduled_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "54G4eA==" -> (known after apply)
!~      detect_md5hash      = "tbHcX1UipfRFpdsq6AUL8A==" -> "different hash"
!~      generation          = 1762367116955720 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs_rollup/fct_monthly_scheduled_stops.sql"
!~      md5hash             = "tbHcX1UipfRFpdsq6AUL8A==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_scheduled_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_rollup/fct_monthly_scheduled_trips.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "5SvXLg==" -> (known after apply)
!~      detect_md5hash      = "q7FoZFnkeZE7lqUfhG3gaA==" -> "different hash"
!~      generation          = 1762367116972108 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs_rollup/fct_monthly_scheduled_trips.sql"
!~      md5hash             = "q7FoZFnkeZE7lqUfhG3gaA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_scheduled_trips.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 3 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1018](https://github.com/cal-itp/data-infra/actions/runs/19479909283)